tap "raine/git-surgeon"

# --- Core ---

brew "zsh"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "pure"
brew "fzf"
brew "ripgrep"
brew "the_silver_searcher"
brew "asdf"
brew "coreutils"
brew "tmux"
brew "neovim"
brew "gh"
brew "gnupg"
brew "imagemagick"
brew "media-info"
brew "worktrunk"
brew "raine/git-surgeon/git-surgeon"

cask "ghostty"
cask "ungoogled-chromium"
cask "1password-cli"
cask "claude"
cask "claude-code"
cask "macvim-app"

vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "alefragnani.project-manager"
vscode "streetsidesoftware.code-spell-checker"
vscode "ms-vscode-remote.remote-containers"
vscode "aaron-bond.better-comments"
vscode "github.copilot-chat"

# --- Stack ---

tap "hashicorp/tap"
tap "minio/stable"

brew "postgresql@16", restart_service: :changed
brew "postgresql@18", restart_service: :changed
brew "rabbitmq", restart_service: :changed
brew "redis", restart_service: :changed
brew "minio", restart_service: :changed
brew "minio/stable/mc"
brew "pipenv"
brew "pre-commit"
brew "trivy"
brew "hashicorp/tap/terraform"

cask "figma"
cask "session-manager-plugin"

vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "bradlc.vscode-tailwindcss"
vscode "unifiedjs.vscode-mdx"
vscode "stylelint.vscode-stylelint"
vscode "jakebecker.elixir-ls"
vscode "pantajoe.vscode-elixir-credo"
vscode "samuel-pordeus.elixir-test"
vscode "phoenixframework.phoenix"
vscode "elmtooling.elm-ls-vscode"
vscode "janne252.fontawesome-autocomplete"
vscode "prisma.prisma"
vscode "vitest.explorer"
vscode "ms-playwright.playwright"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "hbenl.vscode-test-explorer"
