tap "raine/git-surgeon"

brew "zsh"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "pure"
brew "fzf"
brew "ripgrep"
brew "the_silver_searcher"
brew "asdf"
brew "coreutils"
brew "tmux"
brew "neovim"
brew "gh"
brew "gnupg"
brew "imagemagick"
brew "media-info"
brew "worktrunk"
brew "raine/git-surgeon/git-surgeon"

cask "ghostty"
cask "ungoogled-chromium"
cask "1password-cli"
cask "claude"
cask "claude-code"
cask "macvim-app"

vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "alefragnani.project-manager"
vscode "streetsidesoftware.code-spell-checker"
vscode "ms-vscode-remote.remote-containers"
vscode "aaron-bond.better-comments"
vscode "github.copilot-chat"
